{
  "backend/main.mo": "Defines scenarios, user sessions, profiles, and access-controlled queries and updates for a conversation simulation backend.",
  "feature_evidence.json": "Lists feature implementations with associated files, components, tests, and confidence levels for the app.",
  "frontend-file-summaries.txt": "Provides human‑written summaries of all frontend files for reference or documentation.",
  "frontend/index.css": "Tailwind CSS setup defining theme variables, dark mode tokens, and base styling.",
  "frontend/index.html": "HTML entry point that mounts the React app and loads the main script.",
  "frontend/src/App.tsx": "Configures TanStack Router routes and wraps the app with theme and toast providers.",
  "frontend/src/components/AppHeader.tsx": "Renders the top navigation bar with branding, login button, and settings link.",
  "frontend/src/components/AppLayout.tsx": "Page layout including header, main content outlet, footer, and the profile setup modal.",
  "frontend/src/components/AvatarPanel.tsx": "Displays an avatar whose mood changes with state and optionally shows a temporary speech bubble.",
  "frontend/src/components/ChatComposer.tsx": "Message input component with textarea, send button, and voice‑input integration.",
  "frontend/src/components/ChatTranscript.tsx": "Scrollable chat history with formatted timestamps and distinct AI/user message styling.",
  "frontend/src/components/ConfidenceChart.tsx": "Renders an SVG line chart of confidence scores with axes, gridlines, and labels. Computes scaled points from score data and displays a fallback message when empty.",
  "frontend/src/components/LoginButton.tsx": "Provides a login/logout button using Internet Identity with loading states and error handling. Clears cached queries on logout.",
  "frontend/src/components/MetricsPanel.tsx": "Displays confidence score, speaking metrics, and improvement tips with optional text-to-speech. Uses cards, progress bars, and icons for visualization.",
  "frontend/src/components/ProfileSetupModal.tsx": "Shows a modal prompting authenticated users without profiles to enter their name. Saves the profile and manages form state and submission.",
  "frontend/src/components/ProgressTracker.tsx": "Shows user progress stats, recent sessions, and authentication-dependent messaging. Provides navigation to session summaries.",
  "frontend/src/components/QRCodeDisplay.tsx": "Generates a simple placeholder QR code on a canvas for a scenario deep link. Displays the link text below the canvas.",
  "frontend/src/components/RetryResponseButton.tsx": "A small outline button that triggers a retry action. Displays a rotate icon and supports disabling.",
  "frontend/src/components/ScenarioCard.tsx": "Renders a clickable scenario card with icon, title, and a QR code modal. Supports launching the scenario and showing its deep link QR.",
  "frontend/src/components/VoiceInputButton.tsx": "Provides a speech-to-text microphone button with listening states, error display, and transcript callback. Shows tooltip messaging and disables when unsupported.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, including anonymous fallback and admin token initialization. Invalidates related queries when the actor changes.",
  "frontend/src/hooks/useConversationSession.ts": "Manages a conversation session lifecycle, handling messages, analysis, metrics, mood, and persistence with backend and local storage.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, identity loading, and state tracking.",
  "frontend/src/hooks/usePreferences.ts": "Tracks user UI preferences with local storage persistence and exposes an update helper.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend actor calls with React Query for user profiles, scenarios, progress, sessions, and mutations.",
  "frontend/src/hooks/useSpeechToText.ts": "Implements speech recognition handling, managing transcript, errors, and listening state.",
  "frontend/src/hooks/useTextToSpeech.ts": "Provides simple text‑to‑speech controls using the Web Speech API.",
  "frontend/src/index.css": "Defines Tailwind layers and CSS variables for light/dark themes and global styling.",
  "frontend/src/lib/analysis.ts": "Analyzes message content for confidence metrics, generates improvement tips, and produces canned AI responses.",
  "frontend/src/lib/deeplinks.ts": "Builds and parses scenario deep links using URL parameters.",
  "frontend/src/lib/persistence.ts": "Handles saving, loading, and clearing conversation sessions in localStorage, converting message timestamps between bigint and string.",
  "frontend/src/lib/scenarios.ts": "Defines available conversation scenarios and provides helpers to retrieve default or specific scenarios.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers.",
  "frontend/src/pages/ConversationPage.tsx": "Renders the active conversation interface, managing messages, metrics, session flow, and scenario selection.",
  "frontend/src/pages/DashboardPage.tsx": "Displays scenario selection, quick start, and progress tracking, with URL-based scenario redirects.",
  "frontend/src/pages/SessionSummaryPage.tsx": "Shows a session’s summary including metrics, charts, and transcript fetched by session ID.",
  "frontend/src/pages/SettingsPage.tsx": "Provides UI for adjusting theme, avatar type, and other user preferences.",
  "frontend/src/utils/urlParams.ts": "Provides utilities for reading, storing, and clearing URL parameters with session persistence and hash routing support.",
  "frontend/tailwind.config.js": "Tailwind CSS config enabling dark mode, custom colors, animations, fonts, and plugins like typography, container queries, and animate.",
  "project_state.json": "Project state file describing the Social Confidence Simulator’s purpose, architecture, image requirements, and existing implemented features."
}